results/oltp_read_only_8thr_2m/20230830-174706_a7c0e4dcd0ae6f61a84d2a36e9e40a3113cb54f0_1.out
sysbench 1.1.0-2ca9e3f (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 8 tps: 261.47 qps: 4261.40 (r/w/o: 3730.47/0.00/530.93) lat (ms,99%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 8 tps: 297.07 qps: 4747.12 (r/w/o: 4152.98/0.00/594.14) lat (ms,99%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 8 tps: 314.00 qps: 5019.08 (r/w/o: 4391.07/0.00/628.01) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 8 tps: 304.00 qps: 4881.94 (r/w/o: 4273.95/0.00/607.99) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 8 tps: 314.00 qps: 5023.00 (r/w/o: 4395.00/0.00/628.00) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 8 tps: 325.00 qps: 5202.01 (r/w/o: 4552.01/0.00/650.00) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 8 tps: 331.00 qps: 5274.03 (r/w/o: 4612.02/0.00/662.00) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 8 tps: 330.00 qps: 5305.99 (r/w/o: 4645.99/0.00/660.00) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 8 tps: 332.00 qps: 5307.99 (r/w/o: 4643.99/0.00/664.00) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 335.00 qps: 5350.97 (r/w/o: 4680.97/0.00/670.00) lat (ms,99%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 8 tps: 327.00 qps: 5236.99 (r/w/o: 4582.99/0.00/654.00) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 8 tps: 333.01 qps: 5320.09 (r/w/o: 4654.08/0.00/666.01) lat (ms,99%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 8 tps: 325.00 qps: 5220.01 (r/w/o: 4570.01/0.00/650.00) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 8 tps: 327.99 qps: 5217.92 (r/w/o: 4561.93/0.00/655.99) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 323.00 qps: 5194.01 (r/w/o: 4548.01/0.00/646.00) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 8 tps: 313.00 qps: 5011.00 (r/w/o: 4385.00/0.00/626.00) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 8 tps: 315.00 qps: 5035.01 (r/w/o: 4405.01/0.00/630.00) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 8 tps: 303.99 qps: 4867.91 (r/w/o: 4259.92/0.00/607.99) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 8 tps: 301.01 qps: 4802.10 (r/w/o: 4200.08/0.00/602.01) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 322.00 qps: 5157.98 (r/w/o: 4513.98/0.00/644.00) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 8 tps: 331.00 qps: 5300.00 (r/w/o: 4638.00/0.00/662.00) lat (ms,99%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 8 tps: 343.00 qps: 5456.06 (r/w/o: 4770.05/0.00/686.01) lat (ms,99%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 8 tps: 339.99 qps: 5458.91 (r/w/o: 4778.93/0.00/679.99) lat (ms,99%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 8 tps: 326.99 qps: 5246.82 (r/w/o: 4592.84/0.00/653.98) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 339.01 qps: 5399.19 (r/w/o: 4721.17/0.00/678.02) lat (ms,99%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 8 tps: 338.99 qps: 5424.79 (r/w/o: 4746.81/0.00/677.97) lat (ms,99%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 8 tps: 341.02 qps: 5480.29 (r/w/o: 4798.26/0.00/682.04) lat (ms,99%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 8 tps: 340.00 qps: 5411.02 (r/w/o: 4731.02/0.00/680.00) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 8 tps: 344.99 qps: 5528.79 (r/w/o: 4838.82/0.00/689.97) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 330.00 qps: 5271.03 (r/w/o: 4611.03/0.00/660.00) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 8 tps: 309.97 qps: 4972.60 (r/w/o: 4352.65/0.00/619.95) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 8 tps: 318.02 qps: 5100.33 (r/w/o: 4464.29/0.00/636.04) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 8 tps: 320.00 qps: 5108.05 (r/w/o: 4468.05/0.00/640.01) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 8 tps: 307.98 qps: 4927.66 (r/w/o: 4311.70/0.00/615.96) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 313.02 qps: 5000.36 (r/w/o: 4374.31/0.00/626.04) lat (ms,99%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 8 tps: 336.00 qps: 5380.06 (r/w/o: 4708.05/0.00/672.01) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 8 tps: 323.00 qps: 5169.99 (r/w/o: 4523.99/0.00/646.00) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 8 tps: 346.00 qps: 5530.94 (r/w/o: 4838.95/0.00/691.99) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 8 tps: 340.00 qps: 5451.05 (r/w/o: 4771.04/0.00/680.01) lat (ms,99%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 346.01 qps: 5526.12 (r/w/o: 4834.11/0.00/692.02) lat (ms,99%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 8 tps: 345.99 qps: 5547.91 (r/w/o: 4855.92/0.00/691.99) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 8 tps: 329.00 qps: 5259.97 (r/w/o: 4601.97/0.00/658.00) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 8 tps: 322.00 qps: 5136.05 (r/w/o: 4493.05/0.00/643.01) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 8 tps: 315.00 qps: 5076.03 (r/w/o: 4445.03/0.00/631.00) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 332.00 qps: 5271.02 (r/w/o: 4607.02/0.00/664.00) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 8 tps: 333.99 qps: 5347.91 (r/w/o: 4680.93/0.00/666.99) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 8 tps: 328.00 qps: 5286.94 (r/w/o: 4629.95/0.00/656.99) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 8 tps: 328.01 qps: 5221.16 (r/w/o: 4565.14/0.00/656.02) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 8 tps: 328.00 qps: 5254.02 (r/w/o: 4598.02/0.00/656.00) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 341.97 qps: 5484.51 (r/w/o: 4800.57/0.00/683.94) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 8 tps: 346.02 qps: 5505.37 (r/w/o: 4813.33/0.00/692.05) lat (ms,99%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 8 tps: 343.00 qps: 5520.01 (r/w/o: 4834.01/0.00/686.00) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 8 tps: 341.00 qps: 5439.07 (r/w/o: 4757.06/0.00/682.01) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 8 tps: 330.00 qps: 5278.99 (r/w/o: 4618.99/0.00/660.00) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 332.99 qps: 5328.90 (r/w/o: 4662.91/0.00/665.99) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 8 tps: 347.00 qps: 5552.02 (r/w/o: 4858.02/0.00/694.00) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 8 tps: 344.92 qps: 5502.72 (r/w/o: 4812.88/0.00/689.84) lat (ms,99%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 8 tps: 331.08 qps: 5320.33 (r/w/o: 4658.16/0.00/662.17) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 8 tps: 339.99 qps: 5431.91 (r/w/o: 4751.92/0.00/679.99) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 334.00 qps: 5329.06 (r/w/o: 4661.06/0.00/668.01) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 8 tps: 339.00 qps: 5460.04 (r/w/o: 4782.03/0.00/678.00) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 8 tps: 349.00 qps: 5574.00 (r/w/o: 4876.00/0.00/698.00) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 8 tps: 345.00 qps: 5523.98 (r/w/o: 4833.98/0.00/690.00) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 8 tps: 350.00 qps: 5587.03 (r/w/o: 4887.02/0.00/700.00) lat (ms,99%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 8 tps: 364.00 qps: 5833.93 (r/w/o: 5105.94/0.00/727.99) lat (ms,99%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 8 tps: 338.00 qps: 5375.05 (r/w/o: 4700.05/0.00/675.01) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 8 tps: 333.00 qps: 5360.97 (r/w/o: 4693.97/0.00/667.00) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 8 tps: 341.94 qps: 5455.02 (r/w/o: 4771.14/0.00/683.88) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 8 tps: 347.06 qps: 5576.95 (r/w/o: 4882.83/0.00/694.12) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 350.00 qps: 5594.00 (r/w/o: 4894.00/0.00/700.00) lat (ms,99%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 8 tps: 334.98 qps: 5352.76 (r/w/o: 4682.79/0.00/669.97) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 8 tps: 320.94 qps: 5121.02 (r/w/o: 4479.15/0.00/641.88) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 8 tps: 327.08 qps: 5248.24 (r/w/o: 4594.09/0.00/654.16) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 8 tps: 325.99 qps: 5195.76 (r/w/o: 4543.79/0.00/651.97) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 8 tps: 331.96 qps: 5316.30 (r/w/o: 4652.38/0.00/663.91) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 8 tps: 331.06 qps: 5292.96 (r/w/o: 4630.84/0.00/662.12) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 8 tps: 324.00 qps: 5195.93 (r/w/o: 4547.94/0.00/647.99) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 8 tps: 333.00 qps: 5325.02 (r/w/o: 4659.02/0.00/666.00) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 8 tps: 332.00 qps: 5311.95 (r/w/o: 4647.96/0.00/663.99) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 335.90 qps: 5374.40 (r/w/o: 4702.60/0.00/671.80) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 8 tps: 333.08 qps: 5334.35 (r/w/o: 4668.18/0.00/666.17) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 82s ] thds: 8 tps: 329.02 qps: 5259.34 (r/w/o: 4601.30/0.00/658.04) lat (ms,99%): 38.94 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 8 tps: 337.00 qps: 5401.95 (r/w/o: 4727.96/0.00/673.99) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 8 tps: 325.98 qps: 5209.75 (r/w/o: 4557.78/0.00/651.97) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 8 tps: 336.00 qps: 5381.07 (r/w/o: 4709.07/0.00/672.01) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 86s ] thds: 8 tps: 346.02 qps: 5520.31 (r/w/o: 4828.27/0.00/692.04) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 8 tps: 329.98 qps: 5313.68 (r/w/o: 4653.72/0.00/659.96) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 8 tps: 341.02 qps: 5418.26 (r/w/o: 4736.23/0.00/682.03) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 8 tps: 340.00 qps: 5460.99 (r/w/o: 4780.99/0.00/680.00) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 350.00 qps: 5590.97 (r/w/o: 4890.98/0.00/700.00) lat (ms,99%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 8 tps: 356.00 qps: 5712.95 (r/w/o: 5000.95/0.00/711.99) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 8 tps: 377.00 qps: 6014.07 (r/w/o: 5260.06/0.00/754.01) lat (ms,99%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 8 tps: 382.99 qps: 6136.81 (r/w/o: 5370.83/0.00/765.98) lat (ms,99%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 8 tps: 382.01 qps: 6107.16 (r/w/o: 5343.14/0.00/764.02) lat (ms,99%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 8 tps: 379.01 qps: 6076.13 (r/w/o: 5318.12/0.00/758.02) lat (ms,99%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 8 tps: 362.99 qps: 5797.81 (r/w/o: 5071.84/0.00/725.98) lat (ms,99%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 97s ] thds: 8 tps: 361.99 qps: 5794.78 (r/w/o: 5070.80/0.00/723.97) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 98s ] thds: 8 tps: 376.02 qps: 6016.28 (r/w/o: 5264.24/0.00/752.03) lat (ms,99%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 8 tps: 374.01 qps: 5992.12 (r/w/o: 5244.10/0.00/748.01) lat (ms,99%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 374.00 qps: 5984.99 (r/w/o: 5236.99/0.00/748.00) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 101s ] thds: 8 tps: 371.88 qps: 5951.08 (r/w/o: 5207.32/0.00/743.76) lat (ms,99%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 102s ] thds: 8 tps: 357.10 qps: 5690.56 (r/w/o: 4976.37/0.00/714.20) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 103s ] thds: 8 tps: 348.01 qps: 5560.16 (r/w/o: 4864.14/0.00/696.02) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 104s ] thds: 8 tps: 349.98 qps: 5633.73 (r/w/o: 4933.77/0.00/699.97) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 8 tps: 343.03 qps: 5482.43 (r/w/o: 4796.38/0.00/686.05) lat (ms,99%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 106s ] thds: 8 tps: 384.99 qps: 6130.91 (r/w/o: 5360.92/0.00/769.99) lat (ms,99%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 107s ] thds: 8 tps: 376.00 qps: 6043.02 (r/w/o: 5291.02/0.00/752.00) lat (ms,99%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 108s ] thds: 8 tps: 371.00 qps: 5936.96 (r/w/o: 5194.97/0.00/742.00) lat (ms,99%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 109s ] thds: 8 tps: 351.86 qps: 5632.82 (r/w/o: 4929.09/0.00/703.73) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 359.14 qps: 5726.19 (r/w/o: 5007.92/0.00/718.27) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 111s ] thds: 8 tps: 373.01 qps: 5961.10 (r/w/o: 5215.09/0.00/746.01) lat (ms,99%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 112s ] thds: 8 tps: 359.93 qps: 5759.85 (r/w/o: 5039.99/0.00/719.86) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 113s ] thds: 8 tps: 363.07 qps: 5800.16 (r/w/o: 5074.01/0.00/726.15) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 114s ] thds: 8 tps: 350.95 qps: 5633.25 (r/w/o: 4931.34/0.00/701.91) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 8 tps: 337.96 qps: 5415.30 (r/w/o: 4739.39/0.00/675.91) lat (ms,99%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 116s ] thds: 8 tps: 339.08 qps: 5432.36 (r/w/o: 4754.19/0.00/678.17) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 117s ] thds: 8 tps: 337.00 qps: 5370.05 (r/w/o: 4696.05/0.00/674.01) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 118s ] thds: 8 tps: 341.99 qps: 5492.82 (r/w/o: 4808.85/0.00/683.98) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 119s ] thds: 8 tps: 344.01 qps: 5488.10 (r/w/o: 4800.09/0.00/688.01) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 340.96 qps: 5447.31 (r/w/o: 4765.39/0.00/681.91) lat (ms,99%): 38.25 err/s: 0.00 reconn/s: 0.00
Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
      16.408 |                                         3
      16.706 |                                         4
      17.010 |                                         7
      17.319 |                                         26
      17.633 |                                         38
      17.954 |*                                        87
      18.280 |**                                       125
      18.612 |***                                      207
      18.950 |****                                     308
      19.295 |******                                   485
      19.645 |********                                 685
      20.002 |************                             1010
      20.366 |***************                          1229
      20.736 |*******************                      1520
      21.112 |************************                 1935
      21.496 |****************************             2269
      21.886 |********************************         2605
      22.284 |************************************     2971
      22.689 |**************************************   3144
      23.101 |**************************************** 3276
      23.521 |*************************************    3053
      23.948 |**********************************       2807
      24.384 |*******************************          2502
      24.827 |*************************                2038
      25.278 |********************                     1613
      25.737 |***************                          1248
      26.205 |************                             949
      26.681 |********                                 664
      27.165 |******                                   467
      27.659 |****                                     351
      28.162 |****                                     300
      28.673 |***                                      248
      29.194 |***                                      210
      29.725 |**                                       191
      30.265 |**                                       182
      30.815 |**                                       145
      31.375 |**                                       162
      31.945 |**                                       167
      32.525 |**                                       161
      33.116 |**                                       158
      33.718 |**                                       156
      34.330 |**                                       147
      34.954 |**                                       128
      35.589 |**                                       128
      36.236 |*                                        113
      36.894 |*                                        99
      37.565 |*                                        83
      38.247 |*                                        54
      38.942 |                                         35
      39.650 |                                         21
      40.370 |                                         27
      41.104 |                                         19
      41.851 |                                         10
      42.611 |                                         12
      43.385 |                                         12
      44.173 |                                         5
      44.976 |                                         5
      45.793 |                                         1
      46.625 |                                         1
      47.472 |                                         3
      48.335 |                                         5
      49.213 |                                         4
      51.018 |                                         1
      51.945 |                                         2
 
SQL statistics:
    queries performed:
        read:                            568694
        write:                           0
        other:                           81242
        total:                           649936
    transactions:                        40621  (338.44 per sec.)
    queries:                             649936 (5414.99 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      338.4370
    time elapsed:                        120.0253s
    total number of events:              40621

Latency (ms):
         min:                                   16.29
         avg:                                   23.63
         max:                                   52.35
         99th percentile:                       36.24
         sum:                               960058.97

Threads fairness:
    events (avg/stddev):           5077.6250/22.39
    execution time (avg/stddev):   120.0074/0.01